Public Member Functions | Public Attributes | List of all members
API_ElemDifferenceGeneratorState Struct Reference
Element difference generator
Common structure for the element difference generator components. More...
#include <APIdefs_ElementDifferenceGenerator.h>
 Public Member Functions
API_ElemDifferenceGeneratorState ()
API_ElemDifferenceGeneratorState (GSConstHandle handle)
API_ElemDifferenceGeneratorState (const IO::Location &location)
~API_ElemDifferenceGeneratorState ()
void  | operator= (const API_ElemDifferenceGeneratorState &source)
Assignment operator (from a reference to another instance)
void  | operator= (API_ElemDifferenceGeneratorState &&source)
Assignment operator (from a reference to another instance)
 Public Attributes
API_ElemDifferenceGeneratorStateType  | stateType
The type of the difference generator state.
GSHandle  | stateHdl
The effective state of the difference generator, if the stateType is APIDiffState_InMemory.
IO::Location  | fileLocation
The path of the file, that will be use if the stateType is APIDiffState_InFile.
API_Guid  | viewGuid
The view guid, that will assure that the difference come from used element change not from the view settings, used only in APIDiff_ContextBased generator.
Detailed Description
Common structure for the element difference generator components.
Remarks
This structure specify the difference generator state. You can get a elemenet state by the ACAPI_DifferenceGenerator_GetState function, and use in ACAPI_DifferenceGenerator_GenerateDifference function.
Constructor & Destructor Documentation
◆ API_ElemDifferenceGeneratorState() [1/3]
 API_ElemDifferenceGeneratorState::API_ElemDifferenceGeneratorState  |  ( |   | )
inline
◆ API_ElemDifferenceGeneratorState() [2/3]
 API_ElemDifferenceGeneratorState::API_ElemDifferenceGeneratorState  |  ( |  GSConstHandle  |  handle | )
inline
◆ API_ElemDifferenceGeneratorState() [3/3]
 API_ElemDifferenceGeneratorState::API_ElemDifferenceGeneratorState  |  ( |  const IO::Location &  |  location | )
inline
◆ ~API_ElemDifferenceGeneratorState()
 API_ElemDifferenceGeneratorState::~API_ElemDifferenceGeneratorState  |  ( |   | )
inline
Member Function Documentation
◆ operator=() [1/2]
 void API_ElemDifferenceGeneratorState::operator=  |  ( |  API_ElemDifferenceGeneratorState &&  |  source | )
inline
Assignment operator (from a reference to another instance)
◆ operator=() [2/2]
 void API_ElemDifferenceGeneratorState::operator=  |  ( |  const API_ElemDifferenceGeneratorState &  |  source | )
inline
Assignment operator (from a reference to another instance)
Member Data Documentation
◆ fileLocation
 API_ElemDifferenceGeneratorState::fileLocation
The path of the file, that will be use if the stateType is APIDiffState_InFile.
◆ stateHdl
 API_ElemDifferenceGeneratorState::stateHdl
The effective state of the difference generator, if the stateType is APIDiffState_InMemory.
◆ stateType
 API_ElemDifferenceGeneratorState::stateType
The type of the difference generator state.
◆ viewGuid
 API_ElemDifferenceGeneratorState::viewGuid
The view guid, that will assure that the difference come from used element change not from the view settings, used only in APIDiff_ContextBased generator.